<?
$MESS['kit.multiregions_ERROR_TABLE_TRUNCATE_BLOCK'] = "[ERR001] Ошибка очистки таблицы блоков IP";
$MESS['kit.multiregions_ERROR_TABLE_TRUNCATE_CITY'] = "[ERR002] Ошибка очистки таблицы городов";
$MESS['kit.multiregions_ERROR_TABLE_TRUNCATE_REGION'] = "[ERR003] Ошибка очистки таблицы регионов";
$MESS['kit.multiregions_ERROR_TABLE_TRUNCATE_COUNTRY'] = "[ERR004] Ошибка очистки таблицы стран";
$MESS['kit.multiregions_ERROR_STEP1_LOAD_INFO'] = "[ERR005] Ошибка загрузки файла с блоками IP";
$MESS['kit.multiregions_ERROR_STEP1_LOAD_CITY'] = "[ERR006] Ошибка загрузки файла с городами";
$MESS['kit.multiregions_ERROR_STEP2_EXTRACT_INFO'] = "[ERR007] Ошибка распаковки файла с блоками IP";
$MESS['kit.multiregions_ERROR_STEP2_EXTRACT_CITY'] = "[ERR008] Ошибка распаковки файла с городами";
$MESS['kit.multiregions_ERROR_STEP3_CHECK_COUNTRY'] = "[ERR009] Ошибка проверки страны";
$MESS['kit.multiregions_ERROR_STEP3_CHECK_REGION'] = "[ERR010] Ошибка проверки региона";
$MESS['kit.multiregions_ERROR_STEP3_CHECK_CITY'] = "[ERR011] Ошибка проверки города";
$MESS['kit.multiregions_ERROR_STEP3_CHECK_BLOCK'] = "[ERR012] Ошибка записи блока IP";
$MESS['kit.multiregions_ERROR_TABLE_ALTER_DROP_KEY_BLOCK'] = "[ERR013] Ошибка удаления индексов таблицы блоков IP";
$MESS['kit.multiregions_ERROR_TABLE_ALTER_ADD_KEY_BLOCK'] = "[ERR014] Ошибка добавления индексов таблицы блоков IP";
$MESS['kit.multiregions_ERROR_STEP4_UPDATE_COUNTRY'] = "[ERR015] Ошибка обновления страны";
$MESS['kit.multiregions_ERROR_STEP4_ADD_COUNTRY'] = "[ERR016] Ошибка добавления страны";
$MESS['kit.multiregions_ERROR_STEP5_UPDATE_REGION'] = "[ERR017] Ошибка обновления региона";
$MESS['kit.multiregions_ERROR_STEP5_ADD_REGION'] = "[ERR018] Ошибка добавления региона";
$MESS['kit.multiregions_ERROR_STEP6_UPDATE_CITY'] = "[ERR019] Ошибка обновления города";
$MESS['kit.multiregions_ERROR_STEP6_ADD_CITY'] = "[ERR020] Ошибка добавления города";
$MESS['kit.multiregions_ERROR_STEP8_UPDATE_COUNTRY_LOCATION'] = "[ERR021] Ошибка обновления привязки к местоположению страны";
$MESS['kit.multiregions_ERROR_STEP9_UPDATE_REGION_LOCATION'] = "[ERR022] Ошибка обновления привязки к местоположению региона";
$MESS['kit.multiregions_ERROR_STEP9_UPDATE_CITY_LOCATION'] = "[ERR023] Ошибка обновления привязки к местоположению города";
$MESS['kit.multiregions_ERROR_STEP11_ADD_CITY'] = "[ERR024] Ошибка добавления нового города из местоположений битрикс";
$MESS['kit.multiregions_STATUS_TIME'] = "Общее время выполнения: <b>#TIME#</b>";
$MESS['kit.multiregions_STATUS_STEP_0'] = "<b>Очистка таблиц</b><br/>
Загрузка файлов данных<br/>
Распаковка файлов<br/>
Загрузка блоков данных<br/>
Обновление данных по странам<br/>
Обновление данных по регионам<br/>
Обновление данных по городам<br/>
Добавление индексов в таблицу блоков IP адресов<br/>
Привязка стран к местоположениям модуля интернет-магазина<br/>
Привязка регионов к местоположениям модуля интернет-магазина<br/>
Привязка городов к местоположениям модуля интернет-магазина<br/>
Загрузка местоположений битрикс модуля интернет-магазина";
$MESS['kit.multiregions_STATUS_STEP_1'] = "Очистка таблиц<br/>
<b>Загрузка файлов данных</b><br/>
Распаковка файлов<br/>
Загрузка блоков данных<br/>
Обновление данных по странам<br/>
Обновление данных по регионам<br/>
Обновление данных по городам<br/>
Добавление индексов в таблицу блоков IP адресов<br/>
Привязка стран к местоположениям модуля интернет-магазина<br/>
Привязка регионов к местоположениям модуля интернет-магазина<br/>
Привязка городов к местоположениям модуля интернет-магазина<br/>
Загрузка местоположений битрикс модуля интернет-магазина";
$MESS['kit.multiregions_STATUS_STEP_2'] = "Очистка таблиц<br/>
Загрузка файлов данных<br/>
<b>Распаковка файлов</b><br/>
Загрузка блоков данных<br/>
Обновление данных по странам<br/>
Обновление данных по регионам<br/>
Обновление данных по городам<br/>
Добавление индексов в таблицу блоков IP адресов<br/>
Привязка стран к местоположениям модуля интернет-магазина<br/>
Привязка регионов к местоположениям модуля интернет-магазина<br/>
Привязка городов к местоположениям модуля интернет-магазина<br/>
Загрузка местоположений битрикс модуля интернет-магазина";
$MESS['kit.multiregions_STATUS_STEP_3'] = "Очистка таблиц<br/>
Загрузка файлов данных<br/>
Распаковка файлов</br>
<b>Загрузка блоков данных. Текущий блок: #BLOCK#</b><br/>
#PROGRESS_BAR#<br/>
Обновление данных по странам<br/>
Обновление данных по регионам<br/>
Обновление данных по городам<br/>
Добавление индексов в таблицу блоков IP адресов<br/>
Привязка стран к местоположениям модуля интернет-магазина<br/>
Привязка регионов к местоположениям модуля интернет-магазина<br/>
Привязка городов к местоположениям модуля интернет-магазина<br/>
Загрузка местоположений битрикс модуля интернет-магазина";
$MESS['kit.multiregions_STATUS_STEP_4'] = "Очистка таблиц<br/>
Загрузка файлов данных<br/>
Распаковка файлов<br/>
Загрузка блоков данных<br/>
<b>Обновление данных по странам</b><br/>
#PROGRESS_BAR#<br/>
Обновление данных по регионам<br/>
Обновление данных по городам<br/>
Добавление индексов в таблицу блоков IP адресов<br/>
Привязка стран к местоположениям модуля интернет-магазина<br/>
Привязка регионов к местоположениям модуля интернет-магазина<br/>
Привязка городов к местоположениям модуля интернет-магазина<br/>
Загрузка местоположений битрикс модуля интернет-магазина";
$MESS['kit.multiregions_STATUS_STEP_5'] = "Очистка таблиц<br/>
Загрузка файлов данных<br/>
Распаковка файлов<br/>
Загрузка блоков данных<br/>
Обновление данных по странам<br/>
<b>Обновление данных по регионам</b><br/>
#PROGRESS_BAR#<br/>
Обновление данных по городам<br/>
Добавление индексов в таблицу блоков IP адресов<br/>
Привязка стран к местоположениям модуля интернет-магазина<br/>
Привязка регионов к местоположениям модуля интернет-магазина<br/>
Привязка городов к местоположениям модуля интернет-магазина<br/>
Загрузка местоположений битрикс модуля интернет-магазина";
$MESS['kit.multiregions_STATUS_STEP_6'] = "Очистка таблиц<br/>
Загрузка файлов данных<br/>
Распаковка файлов<br/>
Загрузка блоков данных<br/>
Обновление данных по странам<br/>
Обновление данных по регионам<br/>
<b>Обновление данных по городам</b><br/>
#PROGRESS_BAR#<br/>
Добавление индексов в таблицу блоков IP адресов<br/>
Привязка стран к местоположениям модуля интернет-магазина<br/>
Привязка регионов к местоположениям модуля интернет-магазина<br/>
Привязка городов к местоположениям модуля интернет-магазина<br/>
Загрузка местоположений битрикс модуля интернет-магазина";
$MESS['kit.multiregions_STATUS_STEP_7'] = "Очистка таблиц<br/>
Загрузка файлов данных<br/>
Распаковка файлов<br/>
Загрузка блоков данных<br/>
Обновление данных по странам<br/>
Обновление данных по регионам<br/>
Обновление данных по городам<br/>
<b>Добавление индексов в таблицу блоков IP адресов</b><br/>
Привязка стран к местоположениям модуля интернет-магазина<br/>
Привязка регионов к местоположениям модуля интернет-магазина<br/>
Привязка городов к местоположениям модуля интернет-магазина<br/>
Загрузка местоположений битрикс модуля интернет-магазина";
$MESS['kit.multiregions_STATUS_STEP_8'] = "Очистка таблиц<br/>
Загрузка файлов данных<br/>
Распаковка файлов<br/>
Загрузка блоков данных<br/>
Обновление данных по странам<br/>
Обновление данных по регионам<br/>
Обновление данных по городам<br/>
Добавление индексов в таблицу блоков IP адресов<br/>
<b>Привязка стран к местоположениям модуля интернет-магазина</b><br/>
#PROGRESS_BAR#<br/>
Привязка регионов к местоположениям модуля интернет-магазина<br/>
Привязка городов к местоположениям модуля интернет-магазина<br/>
Загрузка местоположений битрикс модуля интернет-магазина";
$MESS['kit.multiregions_STATUS_STEP_9'] = "Очистка таблиц<br/>
Загрузка файлов данных<br/>
Распаковка файлов<br/>
Загрузка блоков данных<br/>
Обновление данных по странам<br/>
Обновление данных по регионам<br/>
Обновление данных по городам<br/>
Добавление индексов в таблицу блоков IP адресов<br/>
Привязка стран к местоположениям модуля интернет-магазина<br/>
<b>Привязка регионов к местоположениям модуля интернет-магазина</b><br/>
#PROGRESS_BAR#<br/>
Привязка городов к местоположениям модуля интернет-магазина<br/>
Загрузка местоположений битрикс модуля интернет-магазина";
$MESS['kit.multiregions_STATUS_STEP_10'] = "Очистка таблиц<br/>
Загрузка файлов данных<br/>
Распаковка файлов<br/>
Загрузка блоков данных<br/>
Обновление данных по странам<br/>
Обновление данных по регионам<br/>
Обновление данных по городам<br/>
Добавление индексов в таблицу блоков IP адресов<br/>
Привязка стран к местоположениям модуля интернет-магазина<br/>
Привязка регионов к местоположениям модуля интернет-магазина<br/>
<b>Привязка городов к местоположениям модуля интернет-магазина</b><br/>
#PROGRESS_BAR#<br/>
Загрузка местоположений битрикс модуля интернет-магазина";
$MESS['kit.multiregions_STATUS_STEP_11'] = "Очистка таблиц<br/>
Загрузка файлов данных<br/>
Распаковка файлов<br/>
Загрузка блоков данных<br/>
Обновление данных по странам<br/>
Обновление данных по регионам<br/>
Обновление данных по городам<br/>
Добавление индексов в таблицу блоков IP адресов<br/>
Привязка стран к местоположениям модуля интернет-магазина<br/>
Привязка регионов к местоположениям модуля интернет-магазина<br/>
Привязка городов к местоположениям модуля интернет-магазина<br/>
<b>Загрузка местоположений битрикс модуля интернет-магазина</b><br/>
#PROGRESS_BAR#";
$MESS['kit.multiregions_SYSTEM_REPLACE_REGION'] = "Ненецкий АО---Ненецкий автономный округ===Карачаево-Черкесия---Карачаево-Черкесская Республика===Ямало-Ненецкий АО---Ямало-Ненецкий автономный округ===Ханты-Мансийский автономный округ - Югра---Ханты-Мансийский автономный округ===Чечня---Чеченская Республика===Удмуртия---Удмуртская Республика===Чувашия---Чувашская Республика===Кабардино-Балкария---Кабардино-Балкарская Республика===Автономная Республика Крым---Крым";

$MESS['kit.multiregions_SYS_REPLACE_KRIM'] = "Автономная Республика Крым";
$MESS['kit.multiregions_SYS_REPLACE_KRIM_RUSSIA'] = "Россия";
$MESS['kit.multiregions_SYS_REPLACE_KRIM_REGION'] = "Крым";
$MESS['kit.multiregions_SYS_REPLACE_SEVASTOPOL'] = "Севастополь";
$MESS['kit.multiregions_SYS_REPLACE_SEVASTOPOL_RUSSIA'] = "Россия";
$MESS['kit.multiregions_SYS_REPLACE_SEVASTOPOL_REGION'] = "Севастополь";
